import 'dart:math';

abstract class TruthOrDareGenerator {
  String getQuestion();
  String getDare();
}

class TruthOrDareLocalGenerator implements TruthOrDareGenerator {
  final Random _random = Random();
  final _questions = [
    "ለመጨረሻ ጊዜ የተናገርከው ውሸት ምንድነው?",
    "በተሽከርካሪ ገጭተህ የምታውቀው ነገር ምንድነው?",
    "ሳትወደው እንደምትወደው ያስመሰልከው ሰው ማን ነው?",
    "የሚያሳፍርህ ያንተ ቅፅል ስም ማን ነው?",
    "በሰውነትህ በጣም የታመምክበት ነገር ምንድነው?",
    "አቃጥለህ ደስ ያሰኘህ ነገር ምንድነው?",
    "በህዝብ ማመላለሻ የሰራኸው አስቂኝ ወይም አደገኛ ነገር ምንድነው?",
    "ሁሉን ማድረግ የሚችል አስማተኛ ብታገኝ እንዲደረግልህ የምትጠይቃቸው ሶስት ነገሮች ምን ምን ናቸው?",
    "ከጓደኞችህ አንዱን የኢትዮጵያ ጠቅላይ ሚኒስቴር ማድረግ ብትችል ማንን ታደርጋለህ?",
    "ለሌላ ሰው የተናገርከው ክፉ ነገር ምንድ ነው?",
    "ምንም መዘዝ ባይኖረው የምታደርገው አንድ ነገር ምንድነው?",
    "በመስተዋት ፊት አድርገህ የምታውቀው አስቂኝ ነገር ምንድነው?",
    "ስለሌላ ሰው ያወራኸው ክፉ ነገር ምንድነው?",
    "ከጓደኞችህ ጋር ለማድረግ ደስ የሚልህ ነገር ግን ቤተሰቦችህ ፊት በፍፁም የማታደርገው ነገር ምንድነው?",
    "በጣም የምትቀናው በማን ነው?",
    "በጣም የምትወደው የቤት ልብስ ምን ይመስላል?",
    "ከትምህርት ቤት ለመውጣት ወይም ለመሄድ የታመምክ አስመስለኸ ታውቃለህ?",
    "በቀን ውስጥ ምን ያህል ሰልፊ ትነሳለህ?",
    "በሳምንት ስንት ቀን ተመሳሳይ ልብስ ታደርጋለህ?",
    "ለመጨረሻ ጊዜ ይቅርታ የጠየከው መቼ ነው? ምክንያቱስ?",
    "መዋኛ ገንዳ ውስጥ ሸንተህ ታውቃለህ?",
    "በሰውነትህ ላይ ፀጉር ያደገበት ያልተለመደ ቦታ የቱ ነው?",
    "እንደማትያዝ እርግጠኛ ብትሆን ማንን ትገድላለህ?",
    "በጣም በገንዘብ እርካሽ የሆነ ከሰው ያገኘኸው ስጦታ ምንድነው?",
    "አብዛኛውን ጊዜ የምትጠቀመው አፕ ምንድነው?",
    "አውሮፕላን ውስጥ ያደረከው አስቂኝ ነገር ምንድነው?",
    "በብዙ ሰው ፊት እርቃን ሆነህ ታውቃለህ?",
    "በሰው ፊት አፍንጫህን አፅድተህ ታውቃለህ?",
    "ዕድሜህን ዋሽተህ ታውቃለህ?",
    "ገላህን ሳትታጠብ ምን ያህል ቆይተህ ታውቃለህ?",
    "ከቤተሰቦችህ ማን ያናድድሀል? ለምን?",
    "በስልክህ አሁን ያለ አሳፋሪ ሜሴጅ ምንድነው?",
    "የሞተ ሰው አይተህ ታውቃለህ?",
    "ለአለቃህ ዋሽተህ ታውቃለህ",
    "ከስራ ቦታ ሰርቀህ ታውቃለህ?",
    "ጥርስህን ሳትቦርሽ ምን ያህል ጊዜ ቆይተህ ታውቃለህ?",
    "በህይወትህ ትልቁ ፀፀትህ ምንድነው?",
    "እርቃኑን ሆኖ ለማየት የማትፈልገው ሰው ማን ነው?",
    "አንድ ሚልየን ብር ይሰጥሀል ከእጮኛህ ተለይ ብትባል ትለያለህ?",
    "የስራ አጋርህን አፍቅረህ ታውቃለህ?",
    "እስካሁን የምትወዳት ግን የተለየሀት የፍቅር ጓደኛ ማን ናት?",
    "ለአስተናጋጅ ሰጥተህ የምታውቀው ትልቁ ቲፕ ስንት ነው?",
    "ልትሰራ የማትችለው አንድ ስራ ምንድነው?",
    "በታም የምትወደው እና የምትጠላው የሰውነትህ ክፍል ምንና ምን ናቸው?",
    "እስካሁን የምታደርገው የህፃን ስራ ምንድነው?",
    "ለጓደኝህ ብለህ ዋሽተህ ታውቃለህ?",
    "አሁን አብረውህ ካሉ ሰዎች ከእያንዳንዳቸው መቀየር የምትፈልገው ነገር ምንድነው?",
    "ሌላ ሰው ያስለቀስክበት የመጨረሻ ቀን መቼ ነው?",
    "በብዙ ሰው ፊት ያደረከው አሳፋሪ ነገር ምንድነው?",
    "በሰው አይን አለመታየት ብትችል የምታደርገው ክፉ ነገር ምንድነው?",
    "በህይወትህ መቀየር የምትመኘው አንድ ነገር ምንድነው?",
    "በህይወትህ አስደናቂው ቀን መቼ ነው?",
    "ፈስተህ በሌላ ሰው አስታከህ ታውቃለህ?",
    "ምን ያህል ሰው ስመህ ታውቃለህ?"
  ];

  final _dares = [
    "50 ፑሽ አፕ ስራ.",
    "በስልክህ ያለ በጣም አሳፋሪ ፎቶ አሳይ.",
    "በቀኝህ ያለውን ሰው እግር እጠብ.",
    "በግራይ ያለውን ሰው አስፀያፊ ነገር ተናገር.",
    "እጅህን ሳትጠቀም ሙዝ ልጠህ ብላ.",
    "ለሁለት ደቂቃ ያለ ሙዚቃ ደንስ.",
    "አይንህን ቀጣይ ተረኛ እስክትሆን ድረስ ጨፍን.",
    "ፈስቡክህ ላይ በተከታታይ ያሉ 15 ፖስቶች ላይክ አድርግ.",
    "በስልክህ ፎንቡክ መጨረሻ ላይ ላለው ሰው የእንኳን አደረሰህ መልእክት ላክ.",
    "አንድ ቀይ ሽንኩርት ብላ.",
    "በአዕምሮህ የሚመጣውን የመጀመርያውን ቃል ጮክ ብለህ ተናገር.",
    "ቦርሳህን ከፍተህ ውስጡ ያለውን ነገር አሳይ.",
    "ለመጨረሻ ጊዜ ሜሰጅ የላክላቸውን አምስት ሰዎች እና መሴጁን አሳይ.",
    "ከለበስካቸው ልብሶች ሶስት ልብሶችን አውልቅ.",
    "ህፃን ልጅ ሲወለድ የሚያለቅሰውን እልቅሻ አስመስል.",
    "ክርኒህን ላስ.",
    "ለ10 ደቂቃ በቀኝህ የተቀመጠውን ሰው ለመሆን ሞክር."
  ];

  int _lastPickedQuestionNumber;

  @override
  String getQuestion() {
    int randomNumber = _random.nextInt(_questions.length);
    while (randomNumber == _lastPickedQuestionNumber) {
      randomNumber = _random.nextInt(_questions.length);
    }
    _lastPickedQuestionNumber = randomNumber;
    return _questions[randomNumber];
  }

  @override
  String getDare() {
    int randomNumber = _random.nextInt(_dares.length);
    while (randomNumber == _lastPickedQuestionNumber) {
      randomNumber = _random.nextInt(_dares.length);
    }
    _lastPickedQuestionNumber = randomNumber;
    return _dares[randomNumber];
  }
}
